---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunGeom
source: html/84a847f0-1601-e65f-170e-d99e1c396373.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunGeom Property

"Show Run Geometry"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRunGeom { get; }
```